const egyptCities = {
  "القاهرة": ["مدينة نصر","مصر الجديدة","المعادي","حلوان","عين شمس","السلام","المرج","الشروق","بدر","القاهرة الجديدة","الزيتون","روض الفرج","شبرا","السيدة زينب","المقطم"],

  "الجيزة": ["الدقي","المهندسين","الهرم","فيصل","العجوزة","إمبابة","بولاق الدكرور","الشيخ زايد","6 أكتوبر","الصف","أطفيح","العياط","البدرشين","كرداسة","أوسيم"],

  "الإسكندرية": ["المنتزه","سيدي جابر","سموحة","العجمي","العامرية","برج العرب","محرم بك","العطارين","الجمرك","الرمل"],

  "القليوبية": ["بنها","شبرا الخيمة","قليوب","القناطر الخيرية","الخانكة","طوخ","كفر شكر"],

  "المنوفية": ["شبين الكوم","منوف","أشمون","السادات","الباجور","قويسنا","تلا","بركة السبع","الشهداء","سرس الليان"],

  "الغربية": ["طنطا","المحلة الكبرى","كفر الزيات","زفتى","السنطة","قطور","بسيون","سمنود"],

  "كفر الشيخ": ["كفر الشيخ","دسوق","فوه","مطوبس","بلطيم","الحامول","بيلا","الرياض","سيدي سالم"],

  "البحيرة": ["دمنهور","كفر الدوار","إدكو","رشيد","أبو حمص","الدلنجات","إيتاي البارود","النوبارية","حوش عيسى","وادي النطرون"],

  "الدقهلية": ["المنصورة","طلخا","ميت غمر","دكرنس","بلقاس","المنزلة","شربين","أجا","السنبلاوين","تمي الأمديد"],

  "الشرقية": ["الزقازيق","العاشر من رمضان","بلبيس","أبو حماد","أبو كبير","فاقوس","الحسينية","منيا القمح","كفر صقر","ههيا"],

  "دمياط": ["دمياط","رأس البر","فارسكور","كفر سعد","الزرقا","دمياط الجديدة"],

  "بورسعيد": ["بورسعيد","بورفؤاد"],

  "الإسماعيلية": ["الإسماعيلية","فايد","القنطرة شرق","القنطرة غرب","التل الكبير","أبو صوير","القصاصين"],

  "السويس": ["السويس","الأربعين","عتاقة","فيصل","الجناين"],

  "شمال سيناء": ["العريش","الشيخ زويد","رفح","بئر العبد","الحسنة","نخل"],

  "جنوب سيناء": ["شرم الشيخ","دهب","نويبع","طابا","رأس سدر","أبو رديس","سانت كاترين","طور سيناء"],

  "الفيوم": ["الفيوم","سنورس","إطسا","طامية","أبشواي","يوسف الصديق"],

  "بني سويف": ["بني سويف","الواسطى","ناصر","إهناسيا","ببا","سمسطا","الفشن"],

  "المنيا": ["المنيا","ملوي","سمالوط","مطاي","بني مزار","مغاغة","العدوة","أبو قرقاص","دير مواس"],

  "أسيوط": ["أسيوط","ديروط","القوصية","منفلوط","أبنوب","أبو تيج","الغنايم","البداري","ساحل سليم","الفتح"],

  "سوهاج": ["سوهاج","أخميم","البلينا","جرجا","طهطا","طما","دار السلام","المراغة","جهينة","المنشأة"],

  "قنا": ["قنا","نجع حمادي","دشنا","قفط","قوص","أبو تشت","فرشوط","نقادة"],

  "الأقصر": ["الأقصر","الزينية","البياضية","القرنة","أرمنت","إسنا","الطود"],

  "أسوان": ["أسوان","دراو","كوم أمبو","إدفو","أبو سمبل","نصر النوبة"],

  "البحر الأحمر": ["الغردقة","رأس غارب","سفاجا","القصير","مرسى علم","الشلاتين","حلايب"],

  "الوادي الجديد": ["الخارجة","الداخلة","الفرافرة","باريس","بلاط"],

  "مطروح": ["مرسى مطروح","الحمام","العلمين","الضبعة","النجيلة","سيدي براني","السلوم","سيوة"]
};